<?php
class CST
{
  //小写半角字母         
  public static $semLowercase = array('a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z');
  public static $lowercaseASCII = array('97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122');
  //大写半角字母
  public static $semUppercase = array('A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z');
  public static $uppercaseASCII = array('65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90');
  //小写全角字母
  public static $douLowercase = array('ａ','ｂ','ｃ','ｄ','ｅ','ｆ','ｇ','ｈ','ｉ','ｊ','ｋ','ｌ','ｍ','ｎ','ｏ','ｐ','ｑ','ｒ','ｓ','ｔ','ｕ','ｖ','ｗ','ｘ','ｙ','ｚ');
  //大写全角字母
  public static $douUppercase = array('Ａ','Ｂ','Ｃ','Ｄ','Ｅ','Ｆ','Ｇ','Ｈ','Ｉ','Ｊ','Ｋ','Ｌ','Ｍ','Ｎ','Ｏ','Ｐ','Ｑ','Ｒ','Ｓ','Ｔ','Ｕ','Ｖ','Ｗ','Ｘ','Ｙ','Ｚ');
  //字母和数字枚举
  public static $numAndLetter = array('0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z','a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z');  
  //地区映射集
  public static $areaCodes = array(
				11 => "北京",12=>"天津",13=>"河北",14=>"山西",15=>"内蒙古",
				21=>"辽宁",22=>"吉林",23=>"黑龙江",
				31=>"上海",32=>"江苏",33=>"浙江",34=>"安徽",35=>"福建",36=>"江西",37=>"山东",
				41=>"河南",42=>"湖北",43=>"湖南",44=>"广东",45=>"广西",46=>"海南",
				50=>"重庆",51=>"四川",52=>"贵州",53=>"云南",54=>"西藏",
				61=>"陕西",62=>"甘肃",63=>"青海",64=>"宁夏",65=>"新疆",
				71=>"台湾",81=>"香港",82=>"澳门",91=>"国外"                                 );
  //性别定义
  public static function genders($option=0)
  {
    if($option) { return  array('N'=>'不限','M'=>'男','F'=>'女','S'=>'保密'); }
    return array('0'=>'不限','1'=>'男','2'=>'女','3'=>'保密');
  }
  //获取省份信息
  public static function province($p)
  {
    if(is_numeric($p) && array_key_exists($p,self::$areaCodes)){ return  self::$areaCodes[$p]; }
    $code = '';
    foreach(self::$areaCodes as $k => $v){  if( $v == $p || $v . '省' == $p || $v . '市' == $p || $v . '特别行政区' == $p ){ $code = $k; break; }    }
    return $code;
  }
}
